# GoLinter

## Go AST

1. `*ast.Ident`是Go语言AST（Abstract Syntax Tree，抽象语法树）包中的一个结构体类型，表示**代码中的标识符（identifier），如变量名、函数名、类型名**等。

   这个结构体类型有如下几个重要的字段：

   - `Name`: 标识符的名称，是一个字符串类型的字面值。
   - `Obj`: 标识符的对象（Object），是一个指向一个对象的指针，这个对象可能是一个变量、常量、函数、类型等。
   - `Pos`: 标识符在源代码中的位置，是一个token.Pos类型的值。

   在Go语言的AST中，`*ast.Ident`类型经常出现在各种表达式中，例如变量声明、函数调用、运算符等等。通过使用这个结构体类型，我们可以方便地获取标识符的名称、位置等信息，从而进行语法分析和代码检查等操作。

2. `ast.Expr` 是一个表示 Go 语言中**所有表达式的接口类型**。它有**多个实现类型**，包括但不限于 `ast.BasicLit`（表示基本字面量），`ast.Ident`（表示标识符），`ast.SelectorExpr`（表示选择器表达式）等等。在 AST 中，许多节点都可能包含一个 `ast.Expr` 类型的表达式字段，因此该接口类型的实现类别是非常丰富的。

   在代码中，当我们需要处理一个表达式节点时，我们可以使用 `ast.Expr` 类型来表示它，这样就可以接收到**各种可能的表达式类型**了。例如，当我们处理一个函数调用时，其参数列表中的每个参数都是一个表达式，因此我们可以使用 `ast.Expr` 来表示它们。

3. `SelectorExpr`是Go语言AST中的一种节点类型，表示选择表达式，即对一个选择器的访问，例如`x.y`、`pkg.Type.Method`等。

   `SelectorExpr`有以下属性：

   - `X`：表示被选择的表达式，类型为`ast.Expr`，通常是一个标识符或一个字段访问表达式。
   - `Sel`：表示被选择的标识符，类型为`*ast.Ident`，表示被选择的标识符的名称。

   例如，对于表达式`foo.bar`，`foo`是`X`，`bar`是`Sel`。

[Golang的抽象语法树(AST) Step By Step - 知乎 (zhihu.com)](https://zhuanlan.zhihu.com/p/380421057)